app/controllers/meetups_controller.rb

SELECT `meetups`.* FROM `meetups`
---
	def index
		@meetups = Meetup.all

INSERT INTO `meetups` (`address`, `city`, `created_at`, `description`, `ends_at`, `name`, `starts_at`, `state`, `updated_at`, `zip`) VALUES ('somewhere test', 'test city', '2014-05-27 17:14:30', 'this will be awesome', '2012-12-22 00:00:00', 'test', '2012-12-21 23:11:00', 'ak', '2014-05-27 17:14:30', '10333')
---
	def create
		@meetup = Meetup.new meetup_params


		if @meetup.save

SELECT  `meetups`.* FROM `meetups`  WHERE `meetups`.`id` = 1 LIMIT 1
---
	def show
		@meetup = Meetup.find params[:id]

UPDATE `meetups` SET `name` = 'test!', `updated_at` = '2014-05-27 17:30:59' WHERE `meetups`.`id` = 1
---
	def update
		if @meetup.update_attributes(meetup_params)

DELETE FROM `meetups` WHERE `meetups`.`id` = 2
---
	def destroy
		@meetup.destroy