app/controllers/users_controller.rb

	def index
		@users = User.includes(:profile).page(params[:page])
---
SELECT  `users`.* FROM `users`  LIMIT 25 OFFSET 0
SELECT `profiles`.* FROM `profiles`  WHERE `profiles`.`user_id` IN (1, 2)

	def create
		@user = User.new user_params
		@profile = Profile.new profile_params

		if @user.valid?
			@user.profile = @profile
			@user.save
---
INSERT INTO `profiles` (`age`, `created_at`, `name`, `updated_at`, `user_id`) VALUES (20, '2014-05-27 20:29:59', 'test2', '2014-05-27 20:29:59', 3)
INSERT INTO `users` (`created_at`, `email`, `password`, `updated_at`) VALUES ('2014-05-23 16:08:44', 'moon@leibowitz.co', '$2a$10$PpSBiJr3FEaFWDSLgsss6OqTerpugfxCxdqmW8DMYZW6lJ7Qg2F96', '2014-05-23 16:08:44')

	def update
		@user.build_profile

		@user.assign_attributes user_params
		@user.profile.assign_attributes profile_params

		if @user.valid? && @user.profile.valid?
			@user.save
---
INSERT INTO `profiles` (`age`, `created_at`, `name`, `updated_at`, `user_id`) VALUES (28, '2014-05-27 21:21:11', 'Moon', '2014-05-27 21:21:11', 1)
UPDATE `users` SET `password` = '$2a$10$oPpjqXKOk07W2WenFnUSYOLuFgpSwS2mgUWp8ObiWIY/PhE8XCfUm', `updated_at` = '2014-05-27 21:21:11' WHERE `users`.`id` = 1

	def destroy
		logout = current_user.id == user.id
		@user.destroy
---
DELETE FROM `users` WHERE `users`.`id` = 4